liroop/ESP32-P4-IMX219-PoC/sdkconfig.defaults
CONFIG_SOC_KEY_MANAGER_FE_KEY_DEPLOY_XTS_AES_256=y
# default:
CONFIG_SOC_KEY_MANAGER_HMAC_KEY_DEPLOY=y
# default:
CONFIG_SOC_KEY_MANAGER_DS_KEY_DEPLOY=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_RSA=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_ECC=y
# default:
CONFIG_SOC_EFUSE_SECURE_BOOT_KEY_DIGESTS=3
# default:
CONFIG_SOC_EFUSE_REVOKE_BOOT_KEY_DIGESTS=y
# default:
CONFIG_SOC_SUPPORT_SECURE_BOOT_REVOKE_KEY=y
# default:
CONFIG_SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX=64
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_OPTIONS=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_128=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_256=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_SUPPORT_PSEUDO_ROUND=y
# default:
CONFIG_SOC_UART_NUM=6
# default:
CONFIG_SOC_UART_HP_NUM=5
# default:
CONFIG_SOC_UART_LP_NUM=1
# default:
CONFIG_SOC_UART_FIFO_LEN=128
# default:
CONFIG_SOC_LP_UART_FIFO_LEN=16
# default:
CONFIG_SOC_UART_BITRATE_MAX=5000000
# default:
CONFIG_SOC_UART_SUPPORT_RTC_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_XTAL_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_WAKEUP_INT=y
# default:
CONFIG_SOC_UART_HAS_LP_UART=y
# default:
CONFIG_SOC_UART_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_UART_WAKEUP_CHARS_SEQ_MAX_LEN=5
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_ACTIVE_THRESH_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_FIFO_THRESH_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_START_BIT_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_CHAR_SEQ_MODE=y
# default:
CONFIG_SOC_LP_I2S_SUPPORT_VAD=y
# default:
CONFIG_SOC_UHCI_NUM=1
# default:
CONFIG_SOC_COEX_HW_PTI=y
# default:
CONFIG_SOC_PHY_DIG_REGS_MEM_SIZE=21
# default:
CONFIG_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP_MODE_PER_PIN=y
# default:
CONFIG_SOC_PM_EXT1_WAKEUP_BY_PMU=y
# default:
CONFIG_SOC_PM_SUPPORT_TOUCH_SENSOR_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_LP_UART_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_CPU_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_XTAL32K_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC32K_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC_FAST_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_VDDSDIO_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_TOP_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_CNNT_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_PERIPH_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_DEEPSLEEP_CHECK_STUB_ONLY=y
# default:
CONFIG_SOC_PM_CPU_RETENTION_BY_SW=y
# default:
CONFIG_SOC_PM_FPU_RETENTION_BY_SW=y
# default:
CONFIG_SOC_PM_CACHE_RETENTION_BY_PAU=y
# default:
CONFIG_SOC_PM_PAU_LINK_NUM=4
# default:
CONFIG_SOC_PM_PAU_REGDMA_LINK_MULTI_ADDR=y
# default:
CONFIG_SOC_PAU_IN_TOP_DOMAIN=y
# default:
CONFIG_SOC_PM_PAU_REGDMA_UPDATE_CACHE_BEFORE_WAIT_COMPARE=y
# default:
CONFIG_SOC_SLEEP_SYSTIMER_STALL_WORKAROUND=y
# default:
CONFIG_SOC_SLEEP_TGWDT_STOP_WORKAROUND=y
# default:
CONFIG_SOC_PM_RETENTION_MODULE_NUM=64
# default:
CONFIG_SOC_CLK_RC_FAST_SUPPORT_CALIBRATION=y
# default:
CONFIG_SOC_CLK_APLL_SUPPORTED=y
# default:
CONFIG_SOC_CLK_MPLL_SUPPORTED=y
# default:
CONFIG_SOC_CLK_XTAL32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_RC32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_LP_PLL=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_XTAL=y
# default:
CONFIG_SOC_PERIPH_CLK_CTRL_SHARED=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_INTR_SUPPORT=y
# default:
CONFIG_SOC_TSENS_IS_INDEPENDENT_FROM_ADC=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_ETM=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MEM_TCM_SUPPORTED=y
# default:
CONFIG_SOC_ASYNCHRONOUS_BUS_ERROR_MODE=y
# default:
CONFIG_SOC_EMAC_IEEE1588V2_SUPPORTED=y
# default:
CONFIG_SOC_EMAC_USE_MULTI_IO_MUX=y
# default:
CONFIG_SOC_EMAC_MII_USE_GPIO_MATRIX=y
# default:
CONFIG_SOC_EMAC_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_JPEG_CODEC_SUPPORTED=y
# default:
CONFIG_SOC_JPEG_DECODE_SUPPORTED=y
# default:
CONFIG_SOC_JPEG_ENCODE_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_CAM_SUPPORT_RGB_YUV_CONV=y
# default:
CONFIG_SOC_LCDCAM_LCD_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_LP_CORE_SUPPORT_ETM=y
# default:
CONFIG_SOC_LP_CORE_SUPPORT_LP_ADC=y
# default:
CONFIG_SOC_LP_CORE_SUPPORT_STORE_LOAD_EXCEPTIONS=y
# default:
CONFIG_IDF_CMAKE=y
# default:
CONFIG_IDF_TOOLCHAIN="gcc"
# default:
CONFIG_IDF_TOOLCHAIN_GCC=y
# default:
CONFIG_IDF_TARGET_ARCH_RISCV=y
# default:
CONFIG_IDF_TARGET_ARCH="riscv"
# default:
CONFIG_IDF_TARGET="esp32p4"
# default:
CONFIG_IDF_INIT_VERSION="6.1.0"
# default:
CONFIG_IDF_TARGET_ESP32P4=y
# default:
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0012

#
# Build type
#
# default:
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
# default:
# CONFIG_APP_BUILD_TYPE_RAM is not set
# default:
CONFIG_APP_BUILD_GENERATE_BINARIES=y
# default:
CONFIG_APP_BUILD_BOOTLOADER=y
# default:
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
# default:
# CONFIG_APP_REPRODUCIBLE_BUILD is not set
# default:
# CONFIG_APP_NO_BLOBS is not set
# end of Build type

#
# Bootloader config
#

#
# Bootloader manager
#
# CONFIG_BOOTLOADER_COMPILE_TIME_DATE is not set
# default:
CONFIG_BOOTLOADER_PROJECT_VER=1
# end of Bootloader manager

#
# Application Rollback
#
# default:
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set
# end of Application Rollback

#
# Recovery Bootloader and Rollback
#
# end of Recovery Bootloader and Rollback

# default:
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x2000
# default:
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
# default:
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
# default:
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF is not set

#
# Log
#
# default:
CONFIG_BOOTLOADER_LOG_VERSION_1=y
# default:
CONFIG_BOOTLOADER_LOG_VERSION=1
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# CONFIG_BOOTLOADER_LOG_LEVEL_ERROR is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_WARN is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_INFO is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE is not set
# default:
CONFIG_BOOTLOADER_LOG_LEVEL=0

#
# Format
#
# default:
# CONFIG_BOOTLOADER_LOG_COLORS is not set
# default:
CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y
# end of Format

#
# Settings
#
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT_EN=y
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT=y
# end of Settings
# end of Log

# default:
CONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=90

#
# Serial Flash Configurations
#
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
# CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT is not set
# end of Serial Flash Configurations

# default:
# CONFIG_BOOTLOADER_FACTORY_RESET is not set
# default:
# CONFIG_BOOTLOADER_APP_TEST is not set
# CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE is not set
# CONFIG_BOOTLOADER_WDT_ENABLE is not set
# default:
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
# default:
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0x10
# default:
# CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_MEM=y
# end of Bootloader config

#
# Security features
#
# default:
CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_ECC_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_PREFERRED=y
# default:
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# default:
CONFIG_SECURE_ROM_DL_MODE_ENABLED=y
# end of Security features

#
# Application manager
#
# CONFIG_APP_COMPILE_TIME_DATE is not set
# default:
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# default:
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# default:
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
# default:
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=9
# end of Application manager

# default:
CONFIG_ESP_ROM_HAS_CRC_LE=y
# default:
CONFIG_ESP_ROM_HAS_CRC_BE=y
# default:
CONFIG_ESP_ROM_UART_CLK_IS_XTAL=y
# default:
CONFIG_ESP_ROM_USB_SERIAL_DEVICE_NUM=6
# default:
CONFIG_ESP_ROM_USB_OTG_NUM=5
# default:
CONFIG_ESP_ROM_HAS_RETARGETABLE_LOCKING=y
# default:
CONFIG_ESP_ROM_GET_CLK_FREQ=y
# default:
CONFIG_ESP_ROM_HAS_RVFPLIB=y
# default:
CONFIG_ESP_ROM_HAS_HAL_WDT=y
# default:
CONFIG_ESP_ROM_HAS_HAL_SYSTIMER=y
# default:
CONFIG_ESP_ROM_SYSTIMER_INIT_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_LAYOUT_TABLE=y
# default:
CONFIG_ESP_ROM_WDT_INIT_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_LP_ROM=y
# default:
CONFIG_ESP_ROM_WITHOUT_REGI2C=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_FORMAT=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_PRINTF_FLOAT_BUG=y
# default:
CONFIG_ESP_ROM_HAS_VERSION=y
# default:
CONFIG_ESP_ROM_CLIC_INT_TYPE_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_OUTPUT_PUTC_FUNC=y
# default:
CONFIG_ESP_ROM_HAS_SUBOPTIMAL_NEWLIB_ON_MISALIGNED_MEMORY=y

#
# Boot ROM Behavior
#
# CONFIG_BOOT_ROM_LOG_ALWAYS_ON is not set
CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y
# CONFIG_BOOT_ROM_LOG_ON_GPIO_HIGH is not set
# CONFIG_BOOT_ROM_LOG_ON_GPIO_LOW is not set
# end of Boot ROM Behavior

#
# Serial flasher config
#
# CONFIG_ESPTOOLPY_NO_STUB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
CONFIG_ESPTOOLPY_FLASHMODE_VAL=3
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_120M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_VAL=80
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=921600

#
# Fast Reflashing
#
# default:
# CONFIG_ESPTOOLPY_FAST_REFLASHING is not set
# end of Fast Reflashing
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
# default:
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# CONFIG_PARTITION_TABLE_MD5 is not set
# end of Partition Table

#
# Example Configuration
#
# default:
CONFIG_EXAMPLE_VIDEO_BUFFER_TYPE_USER=y
# default:
# CONFIG_EXAMPLE_VIDEO_BUFFER_TYPE_DRIVER is not set
# default:
# CONFIG_EXAMPLE_ENABLE_CAM_SENSOR_PIC_VFLIP is not set
# default:
# CONFIG_EXAMPLE_ENABLE_CAM_SENSOR_PIC_HFLIP is not set
# end of Example Configuration

#
# Example Video Initialization Configuration
#
# CONFIG_EXAMPLE_SELECT_ESP32P4_FUNCTION_EV_BOARD_V1_4 is not set
# CONFIG_EXAMPLE_SELECT_ESP32P4_FUNCTION_EV_BOARD_V1_5 is not set
# CONFIG_EXAMPLE_SELECT_ESP32P4_EYE is not set
CONFIG_EXAMPLE_SELECT_CUSTOMIZED_DEV_BOARD=y

#
# Select and Set Camera Sensor Interface
#
# default:
CONFIG_EXAMPLE_ENABLE_MIPI_CSI_CAM_SENSOR=y
# default:
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_PORT=0
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_FREQ=400000
# default:
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_SCL_PIN=8
# default:
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_SDA_PIN=7
# default:
CONFIG_EXAMPLE_MIPI_CSI_CAM_SENSOR_RESET_PIN=-1
# default:
CONFIG_EXAMPLE_MIPI_CSI_CAM_SENSOR_PWDN_PIN=-1
# default:
CONFIG_EXAMPLE_MIPI_CSI_XCLK_PIN=-1
# default:
# CONFIG_EXAMPLE_MIPI_CSI_VIDEO_DEVICE_DONT_INIT_LDO is not set
# end of Select and Set Camera Sensor Interface

# default:
# CONFIG_EXAMPLE_SCCB_I2C_INIT_BY_APP is not set
# default:
CONFIG_EXAMPLE_SELECT_JPEG_HW_DRIVER=y
# default:
# CONFIG_EXAMPLE_SELECT_JPEG_ESP_NEW_JPEG is not set

#
# Storage Configuration
#
# default:
CONFIG_EXAMPLE_SPI_FLASH_MOUNT_POINT="/spiflash"
# default:
CONFIG_EXAMPLE_SPI_FLASH_PARTITION_LABEL="storage"
# default:
CONFIG_EXAMPLE_SDMMC_MOUNT_POINT="/sdmmc"
# default:
# CONFIG_EXAMPLE_FORMAT_STORAGE_IF_MOUNT_FAILED is not set
# default:
# CONFIG_EXAMPLE_FORMAT_STORAGE is not set
# default:
CONFIG_EXAMPLE_SDMMC_SPEED_DS=y
# default:
# CONFIG_EXAMPLE_SDMMC_SPEED_HS is not set
# default:
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_SDR50 is not set
# default:
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_DDR50 is not set
# default:
# CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_4 is not set
# default:
CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_1=y
# default:
# CONFIG_EXAMPLE_SDMMC_DEBUG_PIN_CONNECTIONS is not set
# default:
CONFIG_ENV_GPIO_RANGE_MIN=0
# default:
CONFIG_ENV_GPIO_RANGE_MAX=54
# default:
CONFIG_ENV_GPIO_IN_RANGE_MAX=54
# default:
CONFIG_ENV_GPIO_OUT_RANGE_MAX=54
# default:
CONFIG_EXAMPLE_SDMMC_CMD_PIN=44
# default:
CONFIG_EXAMPLE_SDMMC_CLK_PIN=43
# default:
CONFIG_EXAMPLE_SDMMC_D0_PIN=39
# CONFIG_EXAMPLE_SD_PWR_CTRL_LDO_INTERNAL_IO is not set
# default:
# CONFIG_EXAMPLE_DISABLE_USB_MSC_STORAGE is not set
# end of Storage Configuration
# end of Example Video Initialization Configuration

#
# Compiler options
#
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# default:
# CONFIG_COMPILER_ENABLE_RISCV_ZCMP is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
# default:
# CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE is not set
# default:
# CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB is not set
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_RVFPLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=0
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# default:
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# default:
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# default:
# CONFIG_COMPILER_CXX_RTTI is not set
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# default:
# CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS is not set
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# default:
CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR=y
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING is not set
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
# default:
# CONFIG_BT_ENABLED is not set

#
# Common Options
#

#
# BLE Log
#
# default:
# CONFIG_BLE_LOG_ENABLED is not set
# end of BLE Log

# default:
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# default:
# CONFIG_BT_BLE_LOG_UHCI_OUT_ENABLED is not set
# default:
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options
# end of Bluetooth

#
# Console Library
#
# default:
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# Legacy Driver Configurations
#

#
# Legacy TWAI Driver Configurations
#
# default:
# CONFIG_TWAI_ISR_IN_IRAM_LEGACY is not set
# default:
# CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_TWAI_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy TWAI Driver Configurations

#
# Legacy I2C Driver Configurations
#
# default:
# CONFIG_I2C_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy I2C Driver Configurations

#
# Legacy Touch Sensor Driver Configurations
#
# default:
# CONFIG_TOUCH_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_TOUCH_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Touch Sensor Driver Configurations
# end of Legacy Driver Configurations

#
# eFuse Bit Manager
#
# default:
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# default:
# CONFIG_EFUSE_VIRTUAL is not set
# default:
CONFIG_EFUSE_MAX_BLK_LEN=256
# end of eFuse Bit Manager

#
# ESP-TLS
#
# CONFIG_ESP_TLS_USING_MBEDTLS is not set
CONFIG_ESP_TLS_CUSTOM_STACK=y
# default:
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
# default:
# CONFIG_ESP_TLS_INSECURE is not set
# default:
CONFIG_ESP_TLS_DYN_BUF_STRATEGY_SUPPORTED=y
# end of ESP-TLS

#
# ADC and ADC Calibration
#
# default:
# CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE is not set
# default:
# CONFIG_ADC_ENABLE_DEBUG_LOG is not set
# end of ADC and ADC Calibration

#
# Wireless Coexistence
#
# default:
# CONFIG_ESP_COEX_GPIO_DEBUG is not set
# end of Wireless Coexistence

