liroop/ESP32-P4-IMX219-PoC/sdkconfig.defaults
#
# Common ESP-related
#
# default:
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
# end of Common ESP-related

#
# ESP-Driver:Analog Comparator Configurations
#
# default:
CONFIG_ANA_CMPR_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_ANA_CMPR_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_ANA_CMPR_ISR_CACHE_SAFE is not set
# default:
CONFIG_ANA_CMPR_OBJ_CACHE_SAFE=y
# default:
# CONFIG_ANA_CMPR_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Analog Comparator Configurations

#
# ESP-Driver:BitScrambler Configurations
#
# default:
# CONFIG_BITSCRAMBLER_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:BitScrambler Configurations

#
# ESP-Driver:Camera Controller Configurations
#
# default:
# CONFIG_CAM_CTLR_MIPI_CSI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_CAM_CTLR_ISP_DVP_ISR_CACHE_SAFE is not set
# default:
# CONFIG_CAM_CTLR_DVP_CAM_ISR_CACHE_SAFE is not set
# end of ESP-Driver:Camera Controller Configurations

#
# GDMA Configurations
#
# default:
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_GDMA_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_GDMA_OBJ_DRAM_SAFE=y
# default:
# CONFIG_GDMA_ENABLE_DEBUG_LOG is not set
# end of GDMA Configurations

#
# DW_GDMA Configurations
#
# default:
# CONFIG_DW_GDMA_ENABLE_DEBUG_LOG is not set
# end of DW_GDMA Configurations

#
# 2D-DMA Configurations
#
# default:
# CONFIG_DMA2D_OPERATION_FUNC_IN_IRAM is not set
# default:
# CONFIG_DMA2D_ISR_IRAM_SAFE is not set
# end of 2D-DMA Configurations

#
# ESP-Driver:GPIO Configurations
#
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:GPTimer Configurations
#
# default:
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_GPTIMER_ISR_CACHE_SAFE is not set
# default:
CONFIG_GPTIMER_OBJ_CACHE_SAFE=y
# default:
# CONFIG_GPTIMER_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:GPTimer Configurations

#
# ESP-Driver:I2C Configurations
#
# default:
# CONFIG_I2C_ISR_IRAM_SAFE is not set
# default:
# CONFIG_I2C_ENABLE_DEBUG_LOG is not set
# default:
CONFIG_I2C_MASTER_ISR_HANDLER_IN_IRAM=y
# end of ESP-Driver:I2C Configurations

#
# ESP-Driver:I2S Configurations
#
# default:
# CONFIG_I2S_ISR_IRAM_SAFE is not set
# default:
# CONFIG_I2S_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_I2S_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:I2S Configurations

#
# ESP-Driver:I3C Master Configurations
#
# default:
# CONFIG_I3C_MASTER_ISR_CACHE_SAFE is not set
# default:
# CONFIG_I3C_MASTER_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_I3C_MASTER_ISR_HANDLER_IN_IRAM is not set
# end of ESP-Driver:I3C Master Configurations

#
# ESP-Driver:ISP Configurations
#
# default:
# CONFIG_ISP_ISR_IRAM_SAFE is not set
# default:
# CONFIG_ISP_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:ISP Configurations

#
# ESP-Driver:JPEG-Codec Configurations
#
# default:
# CONFIG_JPEG_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:JPEG-Codec Configurations

#
# ESP-Driver:LEDC Configurations
#
# default:
# CONFIG_LEDC_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:LEDC Configurations

#
# ESP-Driver:MCPWM Configurations
#
# default:
CONFIG_MCPWM_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_MCPWM_ISR_CACHE_SAFE is not set
# default:
# CONFIG_MCPWM_CTRL_FUNC_IN_IRAM is not set
# default:
CONFIG_MCPWM_OBJ_CACHE_SAFE=y
# default:
# CONFIG_MCPWM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:MCPWM Configurations

#
# ESP-Driver:Parallel IO Configurations
#
# default:
CONFIG_PARLIO_TX_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_PARLIO_RX_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_PARLIO_TX_ISR_CACHE_SAFE is not set
# default:
# CONFIG_PARLIO_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_PARLIO_OBJ_CACHE_SAFE=y
# default:
# CONFIG_PARLIO_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_PARLIO_ISR_IRAM_SAFE is not set
# end of ESP-Driver:Parallel IO Configurations

#
# ESP-Driver:PCNT Configurations
#
# default:
# CONFIG_PCNT_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_PCNT_ISR_IRAM_SAFE is not set
# default:
# CONFIG_PCNT_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:PCNT Configurations

#
# ESP-Driver:RMT Configurations
#
# default:
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
# default:
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_RMT_RX_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_RMT_RECV_FUNC_IN_IRAM is not set
# default:
# CONFIG_RMT_TX_ISR_CACHE_SAFE is not set
# default:
# CONFIG_RMT_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_RMT_OBJ_CACHE_SAFE=y
# default:
# CONFIG_RMT_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_RMT_ISR_IRAM_SAFE is not set
# end of ESP-Driver:RMT Configurations

#
# ESP-Driver:Sigma Delta Modulator Configurations
#
# default:
# CONFIG_SDM_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_SDM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Sigma Delta Modulator Configurations

#
# ESP-Driver:SD Host SDMMC Controller Configurations
#
# default:
# CONFIG_SD_HOST_SDMMC_ISR_CACHE_SAFE is not set
# end of ESP-Driver:SD Host SDMMC Controller Configurations

#
# ESP-Driver:SPI Configurations
#
# default:
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
# default:
# CONFIG_SPI_SLAVE_IN_IRAM is not set
# CONFIG_SPI_SLAVE_ISR_IN_IRAM is not set
# end of ESP-Driver:SPI Configurations

#
# ESP-Driver:Touch Sensor Configurations
#
# default:
# CONFIG_TOUCH_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_TOUCH_ISR_IRAM_SAFE is not set
# default:
# CONFIG_TOUCH_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_TOUCH_SKIP_FSM_CHECK is not set
# end of ESP-Driver:Touch Sensor Configurations

#
# ESP-Driver:Temperature Sensor Configurations
#
# default:
# CONFIG_TEMP_SENSOR_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_TEMP_SENSOR_ISR_IRAM_SAFE is not set
# end of ESP-Driver:Temperature Sensor Configurations

#
# ESP-Driver:TWAI Configurations
#
# default:
# CONFIG_TWAI_ISR_IN_IRAM is not set
# default:
# CONFIG_TWAI_IO_FUNC_IN_IRAM is not set
# default:
# CONFIG_TWAI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_TWAI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:TWAI Configurations

#
# ESP-Driver:UART Configurations
#
CONFIG_UART_ISR_IN_IRAM=y
# end of ESP-Driver:UART Configurations

#
# ESP-Driver:UHCI Configurations
#
# default:
# CONFIG_UHCI_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_UHCI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_UHCI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:UHCI Configurations

#
# ESP-Driver:USB Serial/JTAG Configuration
#
# default:
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y
# end of ESP-Driver:USB Serial/JTAG Configuration

#
# Ethernet
#
# CONFIG_ETH_USE_ESP32_EMAC is not set
# CONFIG_ETH_USE_SPI_ETHERNET is not set
# default:
# CONFIG_ETH_USE_OPENETH is not set
# end of Ethernet

#
# Event Loop Library
#
# default:
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR=y
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR_SIZE=4
# default:
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# default:
# CONFIG_ESP_EVENT_LOOP_IN_EXT_RAM is not set
# end of Event Loop Library

#
# GDB Stub
#
# default:
CONFIG_ESP_GDBSTUB_ENABLED=y
# default:
# CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME is not set
# default:
CONFIG_ESP_GDBSTUB_SUPPORT_TASKS=y
# default:
CONFIG_ESP_GDBSTUB_MAX_TASKS=32
# end of GDB Stub

#
# ESP HID
#
# default:
CONFIG_ESPHID_TASK_SIZE_BT=2048
CONFIG_ESPHID_TASK_SIZE_BLE=2048
# end of ESP HID

#
# ESP HTTP client
#
# default:
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_GET_CONTENT_RANGE is not set
# default:
CONFIG_ESP_HTTP_CLIENT_EVENT_POST_TIMEOUT=2000
# default:
CONFIG_ESP_HTTP_CLIENT_PSA_CRYPTO_MIGRATE=y
# default:
# CONFIG_ESP_HTTP_CLIENT_SAVE_RESPONSE_HEADERS is not set
# end of ESP HTTP client

#
# HTTP Server
#
CONFIG_HTTPD_MAX_REQ_HDR_LEN=128
# default:
CONFIG_HTTPD_MAX_URI_LEN=512
# CONFIG_HTTPD_ERR_RESP_NO_DELAY is not set
# default:
CONFIG_HTTPD_PURGE_BUF_LEN=32
# default:
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
# default:
# CONFIG_HTTPD_WS_SUPPORT is not set
# default:
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING is not set
# default:
CONFIG_HTTPD_ENABLE_EVENTS=y
# default:
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=2000
# default:
CONFIG_HTTPD_SERVER_PSA_CRYPTO_MIGRATE=y
# end of HTTP Server

#
# ESP HTTPS OTA
#
# default:
# CONFIG_ESP_HTTPS_OTA_DECRYPT_CB is not set
# default:
# CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP is not set
# default:
CONFIG_ESP_HTTPS_OTA_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_OTA_ENABLE_PARTIAL_DOWNLOAD is not set
# CONFIG_ESP_HTTPS_OTA_VERIFY_SPI_MODE is not set
# end of ESP HTTPS OTA

#
# ESP HTTPS server
#
# default:
# CONFIG_ESP_HTTPS_SERVER_CERT_SELECT_HOOK is not set
# end of ESP HTTPS server

#
# Hardware Settings
#
# default:
CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM=y

#
# Chip revision
#

#
# NOTE! Support of ESP32-P4 rev. <3.0 and >=3.0 is mutually exclusive
#

#
# Read the help text of the option below for explanation
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# CONFIG_ESP32P4_REV_MIN_0 is not set
# CONFIG_ESP32P4_REV_MIN_1 is not set
CONFIG_ESP32P4_REV_MIN_100=y
# default:
CONFIG_ESP32P4_REV_MIN_FULL=100
# default:
CONFIG_ESP_REV_MIN_FULL=100

#
# Maximum Supported ESP32-P4 Revision (Rev v1.99)
#
# default:
CONFIG_ESP32P4_REV_MAX_FULL=199
# default:
CONFIG_ESP_REV_MAX_FULL=199
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=199

#
# Maximum Supported ESP32-P4 eFuse Block Revision (eFuse Block Rev v0.99)
#
# end of Chip revision

#
# MAC Config
#
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_ETH=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES_ONE=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES=1
# default:
CONFIG_ESP32P4_UNIVERSAL_MAC_ADDRESSES_ONE=y
# default:
CONFIG_ESP32P4_UNIVERSAL_MAC_ADDRESSES=1
# default:
# CONFIG_ESP_MAC_USE_CUSTOM_MAC_AS_BASE_MAC is not set
# end of MAC Config

#
# Sleep Config
#
# default:
# CONFIG_ESP_SLEEP_POWER_DOWN_FLASH is not set
# CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND is not set
# CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND is not set
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
# default:
CONFIG_ESP_SLEEP_WAIT_FLASH_READY_EXTRA_DELAY=0
# default:
# CONFIG_ESP_SLEEP_CACHE_SAFE_ASSERTION is not set
# default:
# CONFIG_ESP_SLEEP_DEBUG is not set
# CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS is not set
# CONFIG_ESP_SLEEP_SET_FLASH_DPD is not set
# default:
# CONFIG_ESP_SLEEP_ENABLE_RTC_WDT_IN_SLEEP is not set
# default:
# CONFIG_ESP_SLEEP_ENABLE_RTC_WDT_IN_DEEP_SLEEP is not set
# end of Sleep Config

#
# RTC Clock Config
#
# default:
CONFIG_RTC_CLK_SRC_INT_RC=y
# default:
# CONFIG_RTC_CLK_SRC_EXT_CRYS is not set
CONFIG_RTC_CLK_CAL_CYCLES=0
# CONFIG_RTC_FAST_CLK_SRC_RC_FAST is not set
CONFIG_RTC_FAST_CLK_SRC_XTAL=y
# default:
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
# default:
CONFIG_RTC_TIME_FUNC_IN_IRAM=y
# end of RTC Clock Config

#
# Peripheral Control
#
# default:
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y
# end of Peripheral Control

#
# Event Task Matrix (ETM) Configurations
#
# default:
# CONFIG_ETM_ENABLE_DEBUG_LOG is not set
# end of Event Task Matrix (ETM) Configurations

#
# Main XTAL Config
#
# default:
CONFIG_XTAL_FREQ_40=y
# default:
CONFIG_XTAL_FREQ=40
# end of Main XTAL Config

#
# DCDC Regulator Configurations
#
# default:
CONFIG_ESP_SLEEP_DCM_VSET_VAL_IN_SLEEP=14
# end of DCDC Regulator Configurations

#
# LDO Regulator Configurations
#
# default:
CONFIG_ESP_LDO_RESERVE_SPI_NOR_FLASH=y
# default:
CONFIG_ESP_LDO_CHAN_SPI_NOR_FLASH_DOMAIN=1
# default:
CONFIG_ESP_LDO_VOLTAGE_SPI_NOR_FLASH_3300_MV=y
# default:
CONFIG_ESP_LDO_VOLTAGE_SPI_NOR_FLASH_DOMAIN=3300
# default:
CONFIG_ESP_LDO_RESERVE_PSRAM=y
# default:
CONFIG_ESP_LDO_CHAN_PSRAM_DOMAIN=2
# default:
CONFIG_ESP_LDO_VOLTAGE_PSRAM_1800_MV=y
# default:
CONFIG_ESP_LDO_VOLTAGE_PSRAM_DOMAIN=1800
# end of LDO Regulator Configurations

#
# Power Supplier
#

#
# Brownout Detector
#
# default:
CONFIG_ESP_BROWNOUT_DET=y
# default:
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 is not set
# default:
CONFIG_ESP_BROWNOUT_DET_LVL=7
# default:
CONFIG_ESP_BROWNOUT_USE_INTR=y
# end of Brownout Detector

#
# RTC Backup Battery
#
# default:
# CONFIG_ESP_VBAT_INIT_AUTO is not set
# default:
# CONFIG_ESP_VBAT_WAKEUP_CHIP_ON_VBAT_BROWNOUT is not set
# end of RTC Backup Battery
# end of Power Supplier

# default:
CONFIG_ESP_SPI_BUS_LOCK_ISR_FUNCS_IN_IRAM=y
# default:
CONFIG_ESP_ENABLE_PVT=y
# default:
CONFIG_ESP_INTR_IN_IRAM=y
# default:
CONFIG_P4_REV3_MSPI_WORKAROUND_SIZE=0
# end of Hardware Settings

#
# ESP-Driver:LCD Controller Configurations
#
# default:
# CONFIG_LCD_RGB_ISR_IRAM_SAFE is not set
# default:
# CONFIG_LCD_RGB_RESTART_IN_VSYNC is not set
# CONFIG_LCD_DSI_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_LCD_DSI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_LCD_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:LCD Controller Configurations

#
# LibC
#
# default:
# CONFIG_LIBC_NEWLIB is not set
# default:
CONFIG_LIBC_PICOLIBC=y
# default:
CONFIG_LIBC_PICOLIBC_NEWLIB_COMPATIBILITY=y
# default:
CONFIG_LIBC_MISC_IN_IRAM=y
# default:
CONFIG_LIBC_LOCKS_PLACE_IN_IRAM=y
# default:
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_LF is not set
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_CR is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_CRLF is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_LF is not set
# default:
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
# CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT is not set
CONFIG_LIBC_TIME_SYSCALL_USE_RTC=y
# CONFIG_LIBC_TIME_SYSCALL_USE_HRT is not set
# CONFIG_LIBC_TIME_SYSCALL_USE_NONE is not set
# default:
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=y
CONFIG_LIBC_ASSERT_BUFFER_SIZE=100
# end of LibC

#
# ESP-MM: Memory Management Configurations
#
# default:
# CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS is not set
# end of ESP-MM: Memory Management Configurations

#
# ESP NETIF Adapter
#
# CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE is not set
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=0
# default:
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
# CONFIG_ESP_NETIF_TCPIP_LWIP is not set
CONFIG_ESP_NETIF_LOOPBACK=y
# CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC is not set
# default:
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
# default:
# CONFIG_ESP_NETIF_L2_TAP is not set
# default:
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

#
# PHY
#
# end of PHY

#
# Power Management
#
# default:
# CONFIG_PM_SLEEP_FUNC_IN_IRAM is not set
# default:
# CONFIG_PM_ENABLE is not set
# default:
# CONFIG_PM_SLP_IRAM_OPT is not set
# default:
# CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP is not set
# CONFIG_PM_SLP_SPIRAM_HALFSLEEP_ENABLED is not set
CONFIG_PM_SLP_SPIRAM_HALFSLEEP_EXIT_WAIT_DELAY=50
# end of Power Management

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# PSRAM config
#
# default:
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_SPEED_80M is not set
# CONFIG_SPIRAM_SPEED_20M is not set
# default:
CONFIG_SPIRAM_SPEED=200
# default:
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
# default:
# CONFIG_SPIRAM_ECC_ENABLE is not set
# default:
CONFIG_SPIRAM_BOOT_HW_INIT=y
# default:
CONFIG_SPIRAM_BOOT_INIT=y
# CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION is not set
# default:
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set
# CONFIG_SPIRAM_USE_MEMMAP is not set
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# CONFIG_SPIRAM_USE_MALLOC is not set
# CONFIG_SPIRAM_MEMTEST is not set
# default:
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set
# default:
# CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY is not set
# default:
# CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY is not set
# end of PSRAM config
# end of ESP PSRAM

#
# ESP Ringbuf
#
# default:
# CONFIG_RINGBUF_IN_IRAM is not set
# default:
# CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH is not set
# end of ESP Ringbuf

#
# ESP-ROM
#
# default:
CONFIG_ESP_ROM_PRINT_IN_IRAM=y
# end of ESP-ROM

#
# ESP Security Specific
#
# default:
# CONFIG_ESP_CRYPTO_FORCE_ECC_CONSTANT_TIME_POINT_MUL is not set
# end of ESP Security Specific

#
# ESP-STDIO
#
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
# CONFIG_ESP_CONSOLE_NONE is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# default:
CONFIG_ESP_CONSOLE_UART=y
# default:
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
# default:
# CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_1 is not set
# default:
CONFIG_ESP_CONSOLE_UART_NUM=0
# default:
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
# default:
CONFIG_ESP_CONSOLE_UART_TX_GPIO=37
# default:
CONFIG_ESP_CONSOLE_UART_RX_GPIO=38
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
# end of ESP-STDIO

#
# ESP System Settings
#
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
# default:
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400 is not set
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

#
# Cache config
#
# default:
CONFIG_CACHE_L2_CACHE_128KB=y
# default:
# CONFIG_CACHE_L2_CACHE_256KB is not set
# default:
# CONFIG_CACHE_L2_CACHE_512KB is not set
# default:
CONFIG_CACHE_L2_CACHE_SIZE=0x20000
# default:
CONFIG_CACHE_L2_CACHE_LINE_64B=y
# default:
# CONFIG_CACHE_L2_CACHE_LINE_128B is not set
# default:
CONFIG_CACHE_L2_CACHE_LINE_SIZE=64
# default:
CONFIG_CACHE_L1_CACHE_LINE_SIZE=64
# end of Cache config

