liroop/ESP32-P4-IMX219-PoC/sdkconfig.defaults
# default:
CONFIG_ESP_SYSTEM_IN_IRAM=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
# CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT is not set
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# default:
CONFIG_ESP_SYSTEM_RTC_FAST_MEM_AS_HEAP_DEPCHECK=y
# default:
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
# default:
CONFIG_ESP_SYSTEM_NO_BACKTRACE=y
# default:
# CONFIG_ESP_SYSTEM_USE_EH_FRAME is not set
# default:
# CONFIG_ESP_SYSTEM_USE_FRAME_POINTER is not set
# CONFIG_ESP_SYSTEM_MEMPROT is not set
# default:
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
# default:
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2304
# default:
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1 is not set
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
# CONFIG_ESP_INT_WDT is not set
# CONFIG_ESP_TASK_WDT_EN is not set
# default:
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
# default:
# CONFIG_ESP_DEBUG_STUBS_ENABLE is not set
# CONFIG_ESP_DEBUG_OCDAWARE is not set
# default:
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=y
# CONFIG_ESP_SYSTEM_HW_STACK_GUARD is not set
# CONFIG_ESP_SYSTEM_HW_PC_RECORD is not set
# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# default:
CONFIG_ESP_IPC_ENABLE=y
# default:
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024
# default:
CONFIG_ESP_IPC_USES_CALLERS_PRIORITY=y
# default:
CONFIG_ESP_IPC_ISR_ENABLE=y
# end of IPC (Inter-Processor Call)

#
# ESP Timer (High Resolution Timer)
#
# default:
CONFIG_ESP_TIMER_IN_IRAM=y
# default:
# CONFIG_ESP_TIMER_PROFILING is not set
# default:
CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048
# default:
CONFIG_ESP_TIMER_INTERRUPT_LEVEL=1
# default:
# CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL is not set
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
# default:
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD is not set
# default:
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y
# end of ESP Timer (High Resolution Timer)

#
# ESP Trace Configuration
#
# default:
# CONFIG_ESP_TRACE_LIB_EXTERNAL is not set
# default:
CONFIG_ESP_TRACE_LIB_NONE=y
# default:
CONFIG_ESP_TRACE_LIB_NAME="none"
# default:
# CONFIG_ESP_TRACE_TRANSPORT_APPTRACE is not set
# default:
# CONFIG_ESP_TRACE_TRANSPORT_USB_SERIAL_JTAG is not set
# default:
CONFIG_ESP_TRACE_TRANSPORT_NONE=y
# default:
CONFIG_ESP_TRACE_TRANSPORT_NAME="none"
# end of ESP Trace Configuration

#
# Wi-Fi
#
# default:
# CONFIG_ESP_HOST_WIFI_ENABLED is not set
# default:
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# default:
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
# default:
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=1
# default:
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5
# default:
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
# default:
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=32
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MIN_ACTIVE_TIME=50
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
# default:
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7
# default:
CONFIG_ESP_WIFI_TX_HETB_QUEUE_NUM=3
# end of Wi-Fi

#
# Wi-Fi Remote
#
# default:
CONFIG_ESP_WIFI_REMOTE_IN_IDF=y
# default:
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
# CONFIG_SLAVE_IDF_TARGET_ESP32 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32S2 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C3 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32S3 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C2 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C6 is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C5=y
# CONFIG_SLAVE_IDF_TARGET_ESP32C61 is not set
# default:
CONFIG_SLAVE_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SLAVE_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_NAN_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SLAVE_SOC_WIFI_HW_TSF=y
# default:
CONFIG_SLAVE_SOC_WIFI_FTM_SUPPORT=y
# default:
CONFIG_SLAVE_FREERTOS_UNICORE=y
# default:
CONFIG_SLAVE_SOC_WIFI_GCMP_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_TXOP_SUPPORT=y
# default:
CONFIG_SLAVE_IDF_TARGET_ARCH_RISCV=y
# default:
CONFIG_SLAVE_SOC_WIFI_HE_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MAC_VERSION_NUM=3
# default:
CONFIG_SLAVE_SOC_WIFI_SUPPORT_5G=y

#
# Wi-Fi configuration
#
# default:
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
# default:
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
# default:
# CONFIG_WIFI_RMT_STATIC_TX_BUFFER is not set
# default:
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER=y
# default:
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
# default:
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
# CONFIG_WIFI_RMT_STATIC_RX_MGMT_BUFFER is not set
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUFFER=y
# default:
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=1
# default:
CONFIG_WIFI_RMT_RX_MGMT_BUF_NUM_DEF=5
# default:
# CONFIG_WIFI_RMT_CSI_ENABLED is not set
# CONFIG_WIFI_RMT_AMPDU_TX_ENABLED is not set
# CONFIG_WIFI_RMT_AMPDU_RX_ENABLED is not set
# CONFIG_WIFI_RMT_NVS_ENABLED is not set
# default:
CONFIG_WIFI_RMT_SOFTAP_BEACON_MAX_LEN=752
# default:
CONFIG_WIFI_RMT_MGMT_SBUF_NUM=32
# CONFIG_WIFI_RMT_IRAM_OPT is not set
# CONFIG_WIFI_RMT_EXTRA_IRAM_OPT is not set
# CONFIG_WIFI_RMT_RX_IRAM_OPT is not set
# CONFIG_WIFI_RMT_ENABLE_WPA3_SAE is not set
# CONFIG_WIFI_RMT_ENABLE_WPA3_OWE_STA is not set
# CONFIG_WIFI_RMT_SLP_IRAM_OPT is not set
# default:
CONFIG_WIFI_RMT_SLP_DEFAULT_MIN_ACTIVE_TIME=50
# CONFIG_WIFI_RMT_BSS_MAX_IDLE_SUPPORT is not set
# default:
CONFIG_WIFI_RMT_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# default:
CONFIG_WIFI_RMT_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
# default:
# CONFIG_WIFI_RMT_FTM_ENABLE is not set
# CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE is not set
# default:
# CONFIG_WIFI_RMT_GCMP_SUPPORT is not set
# CONFIG_WIFI_RMT_GMAC_SUPPORT is not set
# CONFIG_WIFI_RMT_SOFTAP_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_SLP_BEACON_LOST_OPT is not set
# default:
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=7
# default:
# CONFIG_WIFI_RMT_NAN_SYNC_ENABLE is not set
# default:
# CONFIG_WIFI_RMT_NAN_USD_ENABLE is not set
# CONFIG_WIFI_RMT_MBEDTLS_CRYPTO is not set
# default:
# CONFIG_WIFI_RMT_WAPI_PSK is not set
# default:
# CONFIG_WIFI_RMT_11KV_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_MBO_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_ENABLE_ROAMING_APP is not set
# default:
# CONFIG_WIFI_RMT_DPP_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_11R_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_ENABLE_WIFI_TX_STATS is not set
# default:
# CONFIG_WIFI_RMT_ENABLE_WIFI_RX_STATS is not set
# default:
CONFIG_WIFI_RMT_TX_HETB_QUEUE_NUM=3
# default:
# CONFIG_WIFI_RMT_ENABLE_DUMP_HESIGB is not set
# default:
# CONFIG_WIFI_RMT_ENABLE_DUMP_MU_CFO is not set
# default:
# CONFIG_WIFI_RMT_ENABLE_DUMP_CTRL_NDPA is not set
# default:
# CONFIG_WIFI_RMT_ENABLE_DUMP_CTRL_BFRP is not set

#
# WPS Configuration Options
#
# default:
# CONFIG_WIFI_RMT_WPS_STRICT is not set
# default:
# CONFIG_WIFI_RMT_WPS_PASSPHRASE is not set
# default:
# CONFIG_WIFI_RMT_WPS_RECONNECT_ON_FAIL is not set
# end of WPS Configuration Options

# default:
# CONFIG_WIFI_RMT_DEBUG_PRINT is not set
# CONFIG_WIFI_RMT_ENTERPRISE_SUPPORT is not set
# end of Wi-Fi configuration

# CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED is not set
# CONFIG_ESP_WIFI_REMOTE_LIBRARY_EPPP is not set
CONFIG_ESP_WIFI_REMOTE_LIBRARY_CUSTOM=y
# end of Wi-Fi Remote

#
# Core dump
#
# default:
# CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH is not set
# default:
# CONFIG_ESP_COREDUMP_ENABLE_TO_UART is not set
# default:
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
# end of Core dump

#
# FAT Filesystem support
#
# default:
CONFIG_FATFS_VOLUME_COUNT=2
CONFIG_FATFS_LFN_NONE=y
# CONFIG_FATFS_LFN_HEAP is not set
# CONFIG_FATFS_LFN_STACK is not set
# default:
# CONFIG_FATFS_SECTOR_512 is not set
# default:
CONFIG_FATFS_SECTOR_4096=y
# default:
# CONFIG_FATFS_CODEPAGE_DYNAMIC is not set
# default:
CONFIG_FATFS_CODEPAGE_437=y
# default:
# CONFIG_FATFS_CODEPAGE_720 is not set
# default:
# CONFIG_FATFS_CODEPAGE_737 is not set
# default:
# CONFIG_FATFS_CODEPAGE_771 is not set
# default:
# CONFIG_FATFS_CODEPAGE_775 is not set
# default:
# CONFIG_FATFS_CODEPAGE_850 is not set
# default:
# CONFIG_FATFS_CODEPAGE_852 is not set
# default:
# CONFIG_FATFS_CODEPAGE_855 is not set
# default:
# CONFIG_FATFS_CODEPAGE_857 is not set
# default:
# CONFIG_FATFS_CODEPAGE_860 is not set
# default:
# CONFIG_FATFS_CODEPAGE_861 is not set
# default:
# CONFIG_FATFS_CODEPAGE_862 is not set
# default:
# CONFIG_FATFS_CODEPAGE_863 is not set
# default:
# CONFIG_FATFS_CODEPAGE_864 is not set
# default:
# CONFIG_FATFS_CODEPAGE_865 is not set
# default:
# CONFIG_FATFS_CODEPAGE_866 is not set
# default:
# CONFIG_FATFS_CODEPAGE_869 is not set
# default:
# CONFIG_FATFS_CODEPAGE_932 is not set
# default:
# CONFIG_FATFS_CODEPAGE_936 is not set
# default:
# CONFIG_FATFS_CODEPAGE_949 is not set
# default:
# CONFIG_FATFS_CODEPAGE_950 is not set
# default:
CONFIG_FATFS_CODEPAGE=437
# default:
CONFIG_FATFS_FS_LOCK=0
# default:
CONFIG_FATFS_TIMEOUT_MS=10000
# CONFIG_FATFS_PER_FILE_CACHE is not set
# default:
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y
# default:
CONFIG_FATFS_ALLOC_PREFER_ALIGNED_WORK_BUFFERS=y
# default:
# CONFIG_FATFS_USE_FASTSEEK is not set
# default:
CONFIG_FATFS_USE_STRFUNC_NONE=y
# default:
# CONFIG_FATFS_USE_STRFUNC_WITHOUT_CRLF_CONV is not set
# default:
# CONFIG_FATFS_USE_STRFUNC_WITH_CRLF_CONV is not set
# default:
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=0
# default:
# CONFIG_FATFS_IMMEDIATE_FSYNC is not set
# default:
# CONFIG_FATFS_USE_LABEL is not set
# default:
CONFIG_FATFS_LINK_LOCK=y
# CONFIG_FATFS_USE_DYN_BUFFERS is not set

#
# File system free space calculation behavior
#
# default:
CONFIG_FATFS_DONT_TRUST_FREE_CLUSTER_CNT=0
# default:
CONFIG_FATFS_DONT_TRUST_LAST_ALLOC=0
# end of File system free space calculation behavior
# end of FAT Filesystem support

#
# FreeRTOS
#

#
# Kernel
#
# default:
# CONFIG_FREERTOS_UNICORE is not set
# default:
CONFIG_FREERTOS_HZ=100
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE is not set
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL is not set
# default:
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# default:
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
# default:
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
# default:
# CONFIG_FREERTOS_USE_IDLE_HOOK is not set
# default:
# CONFIG_FREERTOS_USE_TICK_HOOK is not set
# default:
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
# default:
# CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY is not set
# default:
CONFIG_FREERTOS_USE_TIMERS=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_NAME="Tmr Svc"
# default:
# CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0 is not set
# default:
# CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU1 is not set
# default:
CONFIG_FREERTOS_TIMER_TASK_NO_AFFINITY=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_CORE_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=1
# default:
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
# default:
CONFIG_FREERTOS_TIMER_QUEUE_LENGTH=10
# default:
CONFIG_FREERTOS_QUEUE_REGISTRY_SIZE=0
# default:
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=1
# default:
# CONFIG_FREERTOS_USE_TRACE_FACILITY is not set
# default:
# CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES is not set
# default:
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
# default:
# CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG is not set
# end of Kernel

#
# Port
#
# default:
# CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK is not set
# default:
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y
# default:
# CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK is not set
CONFIG_FREERTOS_CHECK_MUTEX_GIVEN_BY_OWNER=y
# default:
CONFIG_FREERTOS_ISR_STACKSIZE=1536
# CONFIG_FREERTOS_INTERRUPT_BACKTRACE is not set
# default:
CONFIG_FREERTOS_TICK_SUPPORT_SYSTIMER=y
# default:
CONFIG_FREERTOS_CORETIMER_SYSTIMER_LVL1=y
# default:
# CONFIG_FREERTOS_CORETIMER_SYSTIMER_LVL3 is not set
# default:
CONFIG_FREERTOS_SYSTICK_USES_SYSTIMER=y
# default:
# CONFIG_FREERTOS_IN_IRAM is not set
# default:
# CONFIG_FREERTOS_CHECK_PORT_CRITICAL_COMPLIANCE is not set
# end of Port

#
# Extra
#
# default:
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
# end of Extra

# default:
CONFIG_FREERTOS_PORT=y
# default:
CONFIG_FREERTOS_NO_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
# default:
CONFIG_FREERTOS_NUMBER_OF_CORES=2
# end of FreeRTOS

#
# Hardware Abstraction Layer (HAL) and Low Level (LL)
#
# CONFIG_HAL_ASSERTION_EQUALS_SYSTEM is not set
CONFIG_HAL_ASSERTION_DISABLE=y
# default:
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=0
# default:
CONFIG_HAL_WDT_USE_ROM_IMPL=y
# default:
CONFIG_HAL_SYSTIMER_USE_ROM_IMPL=y
# default:
CONFIG_HAL_GPIO_USE_ROM_IMPL=y
# end of Hardware Abstraction Layer (HAL) and Low Level (LL)

#
# Heap memory debugging
#
# default:
CONFIG_HEAP_HAS_EXEC_HEAP=y
# default:
CONFIG_HEAP_POISONING_DISABLED=y
# default:
# CONFIG_HEAP_POISONING_LIGHT is not set
# default:
# CONFIG_HEAP_POISONING_COMPREHENSIVE is not set
# default:
CONFIG_HEAP_TRACING_OFF=y
# default:
# CONFIG_HEAP_TRACING_STANDALONE is not set
# default:
# CONFIG_HEAP_TRACING_TOHOST is not set
# default:
# CONFIG_HEAP_USE_HOOKS is not set
# default:
# CONFIG_HEAP_TASK_TRACKING is not set
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=y
# default:
# CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH is not set
# end of Heap memory debugging

#
# Log
#
# default:
CONFIG_LOG_VERSION_1=y
# default:
# CONFIG_LOG_VERSION_2 is not set
# default:
CONFIG_LOG_VERSION=1

#
# Log Level
#
# default:
# CONFIG_LOG_DEFAULT_LEVEL_NONE is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_ERROR is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_WARN is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# default:
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL=3
# default:
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_MAXIMUM_LEVEL=3

#
# Level Settings
#
# default:
# CONFIG_LOG_MASTER_LEVEL is not set
# default:
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_NONE is not set
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_LINKED_LIST is not set
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_AND_LINKED_LIST=y
# default:
# CONFIG_LOG_TAG_LEVEL_CACHE_ARRAY is not set
# default:
CONFIG_LOG_TAG_LEVEL_CACHE_BINARY_MIN_HEAP=y
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_SIZE=31
# end of Level Settings
# end of Log Level

#
# Format
#
# default:
# CONFIG_LOG_COLORS is not set
# default:
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# default:
# CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM is not set
# end of Format

#
# Settings
#
# default:
CONFIG_LOG_MODE_TEXT_EN=y
# default:
CONFIG_LOG_MODE_TEXT=y
# end of Settings

# default:
CONFIG_LOG_IN_IRAM=y
# end of Log

#
# LWIP
#
# default:
CONFIG_LWIP_ENABLE=y
# default:
CONFIG_LWIP_LOCAL_HOSTNAME="espressif"
# default:
CONFIG_LWIP_TCPIP_TASK_PRIO=18
# default:
# CONFIG_LWIP_TCPIP_CORE_LOCKING is not set
# default:
# CONFIG_LWIP_CHECK_THREAD_SAFETY is not set
# CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES is not set
# default:
# CONFIG_LWIP_L2_TO_L3_COPY is not set
# default:
# CONFIG_LWIP_IRAM_OPTIMIZATION is not set
# default:
# CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION is not set
# CONFIG_LWIP_TIMERS_ONDEMAND is not set
# default:
CONFIG_LWIP_MAX_SOCKETS=10
# default:
# CONFIG_LWIP_USE_ONLY_LWIP_SELECT is not set
# default:
# CONFIG_LWIP_SO_LINGER is not set
# CONFIG_LWIP_SO_REUSE is not set
# default:
# CONFIG_LWIP_SO_RCVBUF is not set
# default:
# CONFIG_LWIP_NETBUF_RECVINFO is not set
# default:
CONFIG_LWIP_IP_DEFAULT_TTL=64
# CONFIG_LWIP_IP4_FRAG is not set
# default:
# CONFIG_LWIP_IP4_REASSEMBLY is not set
# default:
CONFIG_LWIP_IP_REASS_MAX_PBUFS=10
# default:
# CONFIG_LWIP_IP_FORWARD is not set
# default:
# CONFIG_LWIP_STATS is not set
# CONFIG_LWIP_ESP_GRATUITOUS_ARP is not set
# default:
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
# CONFIG_LWIP_DHCP_DOES_ARP_CHECK is not set
# CONFIG_LWIP_DHCP_DOES_ACD_CHECK is not set
CONFIG_LWIP_DHCP_DOES_NOT_CHECK_OFFERED_IP=y
CONFIG_LWIP_DHCP_DISABLE_CLIENT_ID=y
# default:
CONFIG_LWIP_DHCP_DISABLE_VENDOR_CLASS_ID=y
# default:
# CONFIG_LWIP_DHCP_RESTORE_LAST_IP is not set
# default:
CONFIG_LWIP_DHCP_OPTIONS_LEN=69
# default:
CONFIG_LWIP_NUM_NETIF_CLIENT_DATA=0
# default:
CONFIG_LWIP_DHCP_COARSE_TIMER_SECS=1

#
# DHCP server
#
# CONFIG_LWIP_DHCPS is not set
# end of DHCP server

# default:
# CONFIG_LWIP_AUTOIP is not set
# default:
CONFIG_LWIP_IPV4=y
# CONFIG_LWIP_IPV6 is not set
# default:
# CONFIG_LWIP_NETIF_STATUS_CALLBACK is not set
# default:
# CONFIG_LWIP_NETIF_LINK_CALLBACK is not set
# CONFIG_LWIP_NETIF_LOOPBACK is not set

#
# TCP
#
# default:
CONFIG_LWIP_MAX_ACTIVE_TCP=16
# default:
CONFIG_LWIP_MAX_LISTENING_TCP=16
# CONFIG_LWIP_TCP_HIGH_SPEED_RETRANSMISSION is not set
# default:
CONFIG_LWIP_TCP_MAXRTX=12
# default:
CONFIG_LWIP_TCP_SYNMAXRTX=6
# default:
CONFIG_LWIP_TCP_MSS=1440
# default:
CONFIG_LWIP_TCP_TMR_INTERVAL=250
# default:
CONFIG_LWIP_TCP_MSL=60000
# default:
CONFIG_LWIP_TCP_FIN_WAIT_TIMEOUT=20000
# default:
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
# default:
CONFIG_LWIP_TCP_WND_DEFAULT=5760
# default:
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
# default:
CONFIG_LWIP_TCP_ACCEPTMBOX_SIZE=6
# CONFIG_LWIP_TCP_QUEUE_OOSEQ is not set
# CONFIG_LWIP_TCP_OVERSIZE_MSS is not set
CONFIG_LWIP_TCP_OVERSIZE_QUARTER_MSS=y
# CONFIG_LWIP_TCP_OVERSIZE_DISABLE is not set
# default:
CONFIG_LWIP_TCP_RTO_TIME=3000
# end of TCP

#
# UDP
#
# default:
CONFIG_LWIP_MAX_UDP_PCBS=16
# default:
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
# end of UDP

