liroop/ESP32-P4-IMX219-PoC/sdkconfig.defaults
# CONFIG_SPIFFS_PAGE_CHECK is not set
CONFIG_SPIFFS_GC_MAX_RUNS=1
# default:
# CONFIG_SPIFFS_GC_STATS is not set
# default:
CONFIG_SPIFFS_PAGE_SIZE=256
# default:
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# default:
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
# CONFIG_SPIFFS_USE_MAGIC is not set
# default:
CONFIG_SPIFFS_META_LENGTH=4
# CONFIG_SPIFFS_USE_MTIME is not set

#
# Debug Configuration
#
# default:
# CONFIG_SPIFFS_DBG is not set
# default:
# CONFIG_SPIFFS_API_DBG is not set
# default:
# CONFIG_SPIFFS_GC_DBG is not set
# default:
# CONFIG_SPIFFS_CHECK_DBG is not set
# default:
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
# CONFIG_WS_TRANSPORT is not set
# end of Websocket
# end of TCP Transport

#
# Ultra Low Power (ULP) Co-processor
#
# default:
# CONFIG_ULP_COPROC_ENABLED is not set

#
# ULP Debugging Options
#
# end of ULP Debugging Options
# end of Ultra Low Power (ULP) Co-processor

#
# Unity unit testing library
#
# CONFIG_UNITY_ENABLE_FLOAT is not set
# CONFIG_UNITY_ENABLE_DOUBLE is not set
# default:
# CONFIG_UNITY_ENABLE_64BIT is not set
# default:
# CONFIG_UNITY_ENABLE_COLOR is not set
# CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER is not set
# default:
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# default:
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# end of Unity unit testing library

#
# Virtual file system
#
# default:
CONFIG_VFS_SUPPORT_IO=y
# default:
CONFIG_VFS_SUPPORT_DIR=y
# CONFIG_VFS_SUPPORT_SELECT is not set
# default:
# CONFIG_VFS_SUPPORT_TERMIOS is not set
# default:
CONFIG_VFS_MAX_COUNT=8

#
# Host File System I/O (Semihosting)
#
# default:
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# end of Host File System I/O (Semihosting)

# default:
CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# default:
# CONFIG_WL_SECTOR_SIZE_512 is not set
# default:
CONFIG_WL_SECTOR_SIZE_4096=y
# default:
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Espressif Camera Sensors Configurations
#

#
# Camera Sensor Configuration
#

#
# Select and Set Camera Sensor
#
CONFIG_CAMERA_OV5647=y

#
# Auto detect OV5647
#
# default:
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
# end of Auto detect OV5647

#
# Choose supported formats for MIPI CSI interface
#
# default:
# CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS is not set
# CONFIG_CAMERA_OV5647_MIPI_RAW8_800X800_50FPS is not set
# default:
# CONFIG_CAMERA_OV5647_MIPI_RAW8_800X1280_50FPS is not set
CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
# default:
# CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS is not set
# end of Choose supported formats for MIPI CSI interface

# default:
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW10_1920X1080_30FPS=y
# default:
CONFIG_CAMERA_OV5647_MIPI_IF_FORMAT_INDEX_DEFAULT=3
# default:
CONFIG_CAMERA_OV5647_CSI_LINESYNC_ENABLE=y
# default:
# CONFIG_CAMERA_OV5647_ENABLE_MOTOR_BY_GPIO0 is not set
# default:
CONFIG_CAMERA_OV5647_DEFAULT_IPA_JSON_CONFIGURATION_FILE=y
# default:
# CONFIG_CAMERA_OV5647_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE is not set
# end of Select and Set Camera Sensor
# end of Camera Sensor Configuration

#
# Camera XCLK Generator Configuration
#
# default:
# CONFIG_CAMERA_XCLK_USE_LEDC is not set
# default:
CONFIG_CAMERA_XCLK_USE_ESP_CLOCK_ROUTER=y
# end of Camera XCLK Generator Configuration

#
# Camera Motor Control Configuration
#
# default:
# CONFIG_CAM_MOTOR_DW9714 is not set
# end of Camera Motor Control Configuration

# CONFIG_CAM_CTRL_SPI_ENABLE is not set
# end of Espressif Camera Sensors Configurations

#
# Espressif Image Process Algorithm Configuration
#
# default:
CONFIG_ESP_IPA_CONFIG_PARAM_VERSION=1
# default:
CONFIG_ESP_IPA_IAN_ALGORITHM=y
# default:
CONFIG_ESP_IPA_ADN_ALGORITHM=y
# default:
CONFIG_ESP_IPA_AWB_ALGORITHM=y
# default:
CONFIG_ESP_IPA_ACC_ALGORITHM=y
# default:
CONFIG_ESP_IPA_AGC_ALGORITHM=y
# default:
CONFIG_ESP_IPA_AEN_ALGORITHM=y
# default:
CONFIG_ESP_IPA_AF_ALGORITHM=y
# default:
CONFIG_ESP_IPA_ATC_ALGORITHM=y
# default:
CONFIG_ESP_IPA_EXT_CONFIG=y
# end of Espressif Image Process Algorithm Configuration

#
# Espressif SCCB Configurations
#
# default:
CONFIG_ESP_SCCB_TRANS_TIMEOUT_DEFAULT=500
# end of Espressif SCCB Configurations

#
# Espressif Video Configuration
#
# default:
CONFIG_ESP_VIDEO_ENABLE_ISP=y
# default:
CONFIG_ESP_VIDEO_ENABLE_DATA_PREPROCESSING=y
# CONFIG_ESP_VIDEO_CHECK_PARAMETERS is not set
# default:
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
# default:
CONFIG_ESP_VIDEO_DISABLE_MIPI_CSI_DRIVER_BACKUP_BUFFER=y
# CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE is not set
# default:
# CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE is not set
# default:
# CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE is not set
# default:
# CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_VIDEO_DEVICE is not set
# default:
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
# default:
# CONFIG_ISP_PIPELINE_CONTROLLER_TASK_STACK_USE_PSRAM is not set

#
# Video Data Preprocessing
#
# default:
CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT=y
# default:
CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT_RISCV=y
# default:
# CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT_PIE is not set
# default:
# CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT_BITSCRAMBLER is not set
# default:
# CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT_PERF_LOG is not set
# end of Video Data Preprocessing
# end of Espressif Video Configuration

#
# CMake Utilities
#
# default:
# CONFIG_CU_RELINKER_ENABLE is not set
# default:
# CONFIG_CU_DIAGNOSTICS_COLOR_NEVER is not set
# default:
CONFIG_CU_DIAGNOSTICS_COLOR_ALWAYS=y
# default:
# CONFIG_CU_DIAGNOSTICS_COLOR_AUTO is not set
# default:
# CONFIG_CU_GCC_LTO_ENABLE is not set
# default:
# CONFIG_CU_GCC_STRING_1BYTE_ALIGN is not set
# end of CMake Utilities

#
# USB-OTG
#
# default:
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
# default:
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
# default:
# CONFIG_USB_HOST_HW_BUFFER_BIAS_IN is not set
# default:
# CONFIG_USB_HOST_HW_BUFFER_BIAS_PERIODIC_OUT is not set

#
# Hub Driver Configuration
#

#
# Root Port configuration
#
# default:
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250
# default:
CONFIG_USB_HOST_RESET_HOLD_MS=30
# default:
CONFIG_USB_HOST_RESET_RECOVERY_MS=30
# default:
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10
# default:
CONFIG_USB_HOST_RESUME_HOLD_MS=30
# default:
CONFIG_USB_HOST_RESUME_RECOVERY_MS=20
# default:
CONFIG_USB_HOST_SUSPEND_ENTRY_MS=20
# end of Root Port configuration

# default:
# CONFIG_USB_HOST_HUBS_SUPPORTED is not set
# end of Hub Driver Configuration

# default:
# CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK is not set
# default:
# CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM is not set
# default:
CONFIG_USB_OTG_SUPPORTED=y
# end of USB-OTG

#
# USB HOST UVC
#
# default:
# CONFIG_UVC_PRINTF_CONFIGURATION_DESCRIPTOR is not set
CONFIG_UVC_INTERVAL_ARRAY_SIZE=1
# CONFIG_UVC_CHECK_PAYLOAD_HEADER_EOH is not set
# end of USB HOST UVC
# end of Component config

